---
kind: type
id: T:Autodesk.Revit.DB.Architecture.NonContinuousRailInfo
source: html/1ba1192c-2cfc-7996-e087-6b515ea4fb15.htm
---
# Autodesk.Revit.DB.Architecture.NonContinuousRailInfo

A class which contains information needed to define a single non-continuous rail in a [!:Autodesk::Revit::DB::Architecture::RailingType] .

## Syntax (C#)
```csharp
public class NonContinuousRailInfo : IDisposable
```